Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: སེམས་ཅན་ཐམས་ཅད་དང་ཐུན་མོང་དུ་བྱས་ཤིང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྔོ་བ་འདི་ནི། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་གོ་ཆའོ།
en: This is the armor of the perfection of ethical discipline possessed by bodhisattva great beings who practice the perfection of tolerance. “

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་ཅིང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་ཡིད་ལ་བྱ་བས། ཆོས་དེ་དག་ལ་བཟོད་པ་དང་། མོས་པ་དང་།
en: Moreover, Venerable Śāradvatīputra, bodhisattva great beings who practice the perfection of tolerance, through the focusing of their attention with all-aspect omniscience in mind, exhibit endurance, willpower, and reliability with respect to all phenomena.

source: རྟེན་པ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པའི་གོ་ཆའོ།
en: This is the armor of the perfection of tolerance possessed by bodhisattva great beings who practice the perfection of tolerance. “

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་དང་ལྡན་པའི་ཡིད་ལ་བྱ་བས་མ་ཡིན་གྱི། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་ཡིད་ལ་བྱ་བས། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་ཅིང་། བརྩོན་འགྲུས་ཉམས་པར་མི་བྱེད་པ་འདི་ནི།
en: Moreover, Venerable Śāradvatīputra, bodhisattva great beings, through the focusing of their attention with all-aspect omniscience in mind and without the considerations of śrāvakas or pratyekabuddhas, practice the perfection of tolerance and do not degenerate in their perseverance.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་གོ་ཆའོ།
en: This is the armor of the perfection of perseverance possessed by bodhisattva great beings who practice the perfection of tolerance. “

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ། ཉན་ཐོས་དང་རང་སངས་རྒྱས་དང་ལྡན་པའི་ཡིད་ལ་བྱ་བས་མ་ཡིན་གྱི། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་ཡིད་ལ་བྱ་བས། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་ཅིང་། སེམས་རྩེ་གཅིག་ཏུ་བྱེད་པ་འདི་ནི།
en: Moreover, Venerable Śāradvatīputra, bodhisattva great beings, through the focusing of their attention with all-aspect omniscience in mind and without the considerations of śrāvakas or pratyekabuddhas, practice the perfection of tolerance and their minds are one-pointed.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་གོ་ཆའོ།
en: This is the armor of the perfection of meditative concentration possessed by bodhisattva great beings who practice the perfection of tolerance. “

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་དང་ལྡན་པའི་ཡིད་ལ་བྱ་བས་མ་ཡིན་གྱི། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་ཡིད་ལ་བྱ་བས། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་ཅིང་། ཆོས་ཐམས་ཅད་སྒྱུ་མར་བྱས་པའི་འདུ་ཤེས་ཉེ་བར་གནས་ཏེ།
en: Moreover, Venerable Śāradvatīputra, bodhisattva great beings, through the focusing of their attention with all-aspect omniscience in mind and without the considerations of śrāvakas or pratyekabuddhas, practice the perfection of tolerance and maintain the notion that all phenomena are illusory.

source: བཟོད་པ་དེས་རློམ་སེམས་སུ་མི་བྱེད་ཅིང་བཟོད་པ་ལ་མི་དམིགས་པ་འདི་ནི།
en: They do not give rise to conceits on the basis of that tolerance, nor do they apprehend tolerance.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་གོ་ཆའོ།
en: This is the armor of the perfection of wisdom possessed by bodhisattva great beings who practice the perfection of tolerance.

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་གང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་ཡིད་ལ་བྱ་བས། ཕ་རོལ་དུ་ཕྱིན་པ་དེ་དག་དང་། སེམས་ཅན་དང་། བྱང་ཆུབ་ལ་མཚན་མར་མི་བྱེད་ཅིང་།
en: Venerable Śāradvatīputra, bodhisattva great beings, through the focusing of their attention with all-aspect omniscience in mind, neither conceptualize nor apprehend these six perfections, beings, or enlightenment.

source: མི་དམིགས་པ་འདི་ནི། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི། ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་གི་གོ་ཆའོ།
en: This is the armor of the six perfections possessed by bodhisattva great beings who practice the perfection of tolerance. “

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་ཅིང་། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་དང་ལྡན་པའི་ཡིད་ལ་བྱ་བས་མ་ཡིན་གྱི། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་ཡིད་ལ་བྱ་བས། སྦྱིན་པ་ཡོངས་སུ་གཏོང་ཞིང་། དགེ་བའི་རྩ་བ་དེ་ཡང་སེམས་ཅན་ཐམས་ཅད་དང་ཐུན་མོང་དུ་བྱས་ཏེ།
en: Moreover, Venerable Śāradvatīputra, bodhisattva great beings who practice the perfection of perseverance, without the considerations of śrāvakas or pratyekabuddhas, but through the focusing of their attention with all-aspect omniscience in mind, offer acts of generosity, and indeed dedicate the roots of their virtuous actions for the sake of unsurpassed, complete enlightenment, making common cause with all beings.

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྔོ་བ་འདི་ནི། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པའི་གོ་ཆའོ།
en: This is the armor of the perfection of generosity possessed by bodhisattva great beings who practice the perfection of perseverance. “

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་ཅིང་། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་དང་ལྡན་པའི་ཡིད་ལ་བྱ་བས་མ་ཡིན་གྱི། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་ཡིད་ལ་བྱ་བས། ཚུལ་ཁྲིམས་སྲུང་ཞིང་། དགེ་བའི་རྩ་བ་དེ་ཡང་སེམས་ཅན་ཐམས་ཅད་དང་ཐུན་མོང་དུ་བྱས་ཏེ།
en: Moreover, Venerable Śāradvatīputra, bodhisattva great beings who practice the perfection of perseverance, without the considerations of śrāvakas or pratyekabuddhas, but through the focusing of their attention with all-aspect omniscience in mind, maintain ethical discipline, and indeed dedicate the roots of their virtuous actions to unsurpassed, complete enlightenment, making common cause with all beings.

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྔོ་བ་འདི་ནི། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པའི། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་གོ་ཆའོ།
en: This is the armor of the perfection of ethical discipline possessed by bodhisattva great beings who practice the perfection of perseverance. “

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་དང་ལྡན་པའི་ཡིད་ལ་བྱ་བས་མ་ཡིན་གྱི། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་ཡིད་ལ་བྱ་བས་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་ཅིང་། ཆོས་དེ་དག་ལ་དེ་ལྟར་བཟོད་པ་དང་།
en: Moreover, Venerable Śāradvatīputra, bodhisattva great beings are without the considerations of śrāvakas or pratyekabuddhas, but through the focusing of their attention with all-aspect omniscience in mind, they practice the perfection of perseverance and exhibit endurance, willpower, and reliability with respect to all phenomena.

source: མོས་པ་དང་། རྟེན་པ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པའི་གོ་ཆའོ།
en: This is the armor of the perfection of tolerance possessed by bodhisattva great beings who practice the perfection of perseverance. “

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་དང་ལྡན་པའི་ཡིད་ལ་བྱ་བས་མ་ཡིན་གྱི། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་ཡིད་ལ་བྱ་བས། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་ཅིང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་དོན་དུ།
en: Moreover, Venerable Śāradvatīputra, bodhisattva great beings are without the considerations of śrāvakas or pratyekabuddhas, but through the focusing of their attention with all-aspect omniscience in mind, they practice the perfection of perseverance and, for the sake of all beings, they do not degenerate in their perseverance, nor do they lack diligence.

source: བརྩོན་འགྲུས་ཉམ་པར་མི་བྱེད་ཅིང་བརྟུན་མི་ངས་པ་འདི་ནི། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་གོ་ཆའོ།
en: This is the armor of the perfection of perseverance possessed by bodhisattva great beings who practice the perfection of perseverance. “

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་དང་ལྡན་པའི་ཡིད་ལ་བྱ་བས་མ་ཡིན་གྱི། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་ཡིད་ལ་བྱ་བས། སེམས་རྩེ་གཅིག་ཏུ་བྱེད་པ་འདི་ནི།
en: Moreover, Venerable Śāradvatīputra, bodhisattva great beings are without the considerations of śrāvakas or pratyekabuddhas, but through the focusing of their attention with all-aspect omniscience in mind, they have minds that are one-pointed.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་གོ་ཆའོ།
en: This is the armor of the perfection of meditative concentration possessed by bodhisattva great beings who practice the perfection of perseverance. “

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་དང་ལྡན་པའི་ཡིད་ལ་བྱ་བས་མ་ཡིན་གྱི། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་ཡིད་ལ་བྱ་བས། ཆོས་ཐམས་ཅད་ལ་སྒྱུ་མར་བྱས་པའི་འདུ་ཤེས་ཉེ་བར་གནས་ཏེ།
en: Moreover, Venerable Śāradvatīputra, bodhisattva great beings are without the considerations of śrāvakas or pratyekabuddhas, but through the focusing of their attention with all-aspect omniscience in mind, they maintain the notion that all phenomena are illusory.

source: བརྩོན་འགྲུས་དེས་རློམ་སེམས་སུ་མི་བྱེད་ཅིང་། བརྩོན་འགྲུས་དེ་ཡང་མི་དམིགས་ཏེ། དགེ་བའི་རྩ་བ་དེ་ཡང་སེམས་ཅན་ཐམས་ཅད་དང་ཐུན་མོང་དུ་བྱས་ཤིང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྔོ་བ་འདི་ནི།
en: They do not give rise to conceits on the basis of this perseverance, nor do they apprehend perseverance, and they indeed dedicate the roots of their virtuous actions for the sake of unsurpassed, complete enlightenment, making common cause with all beings.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་གོ་ཆའོ།
en: This is the armor of the perfection of wisdom possessed by bodhisattva great beings who practice the perfection of perseverance. “

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་གང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་ཡིད་ལ་བྱ་བས། ཕ་རོལ་དུ་ཕྱིན་པ་དེ་དག་དང་། སེམས་ཅན་དང་། བྱང་ཆུབ་ལ་མཚན་མར་མི་བྱེད་ཅིང་། མི་དམིགས་པ་འདི་ནི།
en: Venerable Śāradvatīputra, bodhisattva great beings who focus their attention with all-aspect omniscience in mind neither conceptualize nor apprehend these six perfections, beings, or enlightenment.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི། ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་གི་གོ་ཆའོ།
en: This is the armor of the six perfections possessed by bodhisattva great beings who practice the perfection of perseverance. “

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་ཅིང་། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་དང་ལྡན་པའི་ཡིད་ལ་བྱ་བས་མ་ཡིན་གྱི། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་ཡིད་ལ་བྱ་བས། སྦྱིན་པ་ཡོངས་སུ་གཏོང་ཞིང་། དགེ་བའི་རྩ་བ་དེ་ཡང་སེམས་ཅན་ཐམས་ཅད་དང་ཐུན་མོང་དུ་བྱས་ཏེ།
en: Moreover, Venerable Śāradvatīputra, bodhisattva great beings who practice the perfection of meditative concentration, without the considerations of śrāvakas or pratyekabuddhas, but through the focusing of their attention with all-aspect omniscience in mind, offer their acts of generosity, and indeed dedicate the roots of their virtuous actions for the sake of unsurpassed, complete enlightenment, making common cause with all beings.

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྔོ་བ་འདི་ནི། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པའི་གོ་ཆའོ།
en: This is the armor of the perfection of generosity possessed by bodhisattva great beings who practice the perfection of meditative concentration. “

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་ཅིང་། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་དང་ལྡན་པའི་ཡིད་ལ་བྱ་བས་མ་ཡིན་གྱི། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་ཡིད་ལ་བྱ་བས།
en: Moreover, Venerable Śāradvatīputra, bodhisattva great beings who practice the perfection of meditative concentration, without the considerations of śrāvakas or pratyekabuddhas, but through the focusing of their attention with all-aspect omniscience in mind, maintain ethical discipline, and indeed dedicate the roots of their virtuous actions to unsurpassed, complete enlightenment, making common cause with all beings.

source: ཚུལ་ཁྲིམས་སྲུང་ཞིང་། དགེ་བའི་རྩ་བ་དེ་ཡང་སེམས་ཅན་ཐམས་ཅད་དང་ཐུན་མོང་དུ་བྱས་ཏེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྔོ་བ་འདི་ནི། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་གོ་ཆའོ།
en: This is the armor of the perfection of ethical discipline possessed by bodhisattva great beings who practice the perfection of meditative concentration. “

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་ཅིང་། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་དང་ལྡན་པའི་ཡིད་ལ་བྱ་བས་མ་ཡིན་གྱི། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་ཡིད་ལ་བྱ་བས། བཟོད་པ་ཡོངས་སུ་སྒོམ་སྟེ། དགེ་བའི་རྩ་བ་དེ་ཡང་སེམས་ཅན་ཐམས་ཅད་དང་ཐུན་མོང་དུ་བྱས་ཤིང་།
en: Moreover, Venerable Śāradvatīputra, bodhisattva great beings who practice the perfection of meditative concentration, without the considerations of śrāvakas or pratyekabuddhas, but through the focusing of their attention with all-aspect omniscience in mind, cultivate tolerance and indeed dedicate the roots of their virtuous actions to unsurpassed, complete enlightenment, making common cause with all beings.

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྔོ་བ་འདི་ནི། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པའི་གོ་ཆའོ།
en: This is the armor of the perfection of tolerance possessed by bodhisattva great beings who practice the perfection of meditative concentration. “

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་དང་ལྡན་པའི་ཡིད་བྱ་བས་མ་ཡིན་གྱི། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་ཡིད་ལ་བྱ་བས། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་ཅིང་།
en: Moreover, Venerable Śāradvatīputra, bodhisattva great beings are without the considerations of śrāvakas or pratyekabuddhas, but through the focusing of their attention with all-aspect omniscience in mind, they practice the perfection of meditative concentration and do not degenerate in their perseverance.

source: བརྩོན་འགྲུས་ཉམ་པར་མི་བྱེད་དེ་དེའི་དགེ་བའི་རྩ་བ་དེ་ཡང་སེམས་ཅན་ཐམས་ཅད་དང་ཐུན་མོང་དུ་བྱས་ཤིང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྔོ་བ་འདི་ནི།
en: They indeed dedicate the roots of their virtuous actions to unsurpassed, complete enlightenment, making common cause with all beings.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་གོ་ཆའོ།
en: This is the armor of the perfection of perseverance possessed by bodhisattva great beings who practice the perfection of meditative concentration. “

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་ཅིང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་ཡིད་ལ་བྱ་བ་ལ། སེམས་རྩེ་གཅིག་ཏུ་བྱེད་དེ། དེ་ལ་དམིགས་པ་གཅིག་པའི་ཕྱིར།
en: Moreover, Venerable Śāradvatīputra, when bodhisattva great beings practice the perfection of meditative concentration through the focusing of their attention with all-aspect omniscience in mind, their minds are one-pointed, with a single focus.

source: ཉན་ཐོས་དང་། རང་སངས་རྒྱས་དང་ལྡན་པའི་ཡིད་ལ་བྱ་བ་རྣམས་ཀྱི་གོ་མི་འབྱེད་ཅིང་དགེ་བའི་རྩ་བ་དེ་ཡང་སེམས་ཅན་ཐམས་ཅད་དང་ཐུན་མོང་དུ་བྱས་ཏེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྔོ་བ་འདི་ནི།
en: They do not allow an opportunity for the considerations of śrāvakas or pratyekabuddhas [to develop], and, making common cause with all beings, they indeed dedicate the roots of their virtuous actions to unsurpassed, complete enlightenment.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་གོ་ཆའོ།
en: This is the armor of the perfection of meditative concentration possessed by bodhisattva great beings who practice the perfection of meditative concentration. “

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་ཅིང་། ཆོས་ཐམས་ཅད་ལ་སྒྱུ་མར་བྱས་པའི་འདུ་ཤེས་ཉེ་བར་གནས་ཏེ།
en: Moreover, Venerable Śāradvatīputra, bodhisattva great beings practice the perfection of meditative concentration, and maintain the notion that all phenomena are illusory.

source: བསམ་གཏན་དེས་ཀྱང་རློམ་སེམས་སུ་མི་བྱེད་ཅིང་། བསམ་གཏན་དེ་ཡང་མི་དམིགས་ཏེ། དགེ་བའི་རྩ་བ་དེ་ཡང་སེམས་ཅན་ཐམས་ཅད་དང་ཐུན་མོང་དུ་བྱས་ཤིང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྔོ་བ་འདི་ནི།
en: They do not give rise to conceits on the basis of that meditative concentration, nor do they apprehend that meditative concentration, and they indeed dedicate the roots of their virtuous actions for the sake of unsurpassed, complete enlightenment, making common cause with all beings.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་གོ་ཆའོ།
en: This is the armor of the perfection of wisdom possessed by bodhisattva great beings who practice the perfection of meditative concentration.

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་གང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་ཡིད་ལ་བྱ་བས། ཕ་རོལ་དུ་ཕྱིན་པ་དེ་དག་དང་། སེམས་ཅན་དང་། བྱང་ཆུབ་ལ་མཚན་མར་མི་བྱེད་ཅིང་།
en: Venerable Śāradvatīputra, bodhisattva great beings, through the focusing of their attention with all-aspect omniscience in mind, neither conceptualize nor apprehend these six perfections, beings, or enlightenment.

source: མི་དམིགས་པ་འདི་ནི། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི། ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་གི་གོ་ཆའོ།
en: This is the armor of the six perfections possessed by bodhisattva great beings who practice the perfection of meditative concentration. “

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་ཅིང་། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་དང་ལྡན་པའི་ཡིད་ལ་བྱ་བས་མ་ཡིན་གྱི། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་ཡིད་ལ་བྱ་བས། འཁོར་གསུམ་ཡོངས་སུ་དག་པའི་སྦྱིན་པ་ཡོངས་སུ་གཏོང་ཞིང་། དགེ་བའི་རྩ་བ་དེ་ཡང་སེམས་ཅན་ཐམས་ཅད་དང་ཐུན་མོང་དུ་བྱས་ཏེ།
en: Moreover, Venerable Śāradvatīputra, when bodhisattva great beings practice the perfection of wisdom without the considerations of śrāvakas or pratyekabuddhas, but through the focusing of their attention with all-aspect omniscience in mind, they offer acts of generosity, purified of the three spheres, and indeed dedicate the roots of their virtuous actions for the sake of unsurpassed, complete enlightenment, making common cause with all beings.

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྔོ་བ་འདི་ནི། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པའི་གོ་ཆའོ།
en: This is the armor of the perfection of generosity possessed by bodhisattva great beings who practice the perfection of wisdom. “

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་ཅིང་། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་དང་ལྡན་པའི་ཡིད་ལ་བྱ་བས་མ་ཡིན་གྱི། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་ཡིད་ལ་བྱ་བས། ཚུལ་ཁྲིམས་ཡོངས་སུ་སྲུང་ཞིང་། དགེ་བའི་རྩ་བ་དེ་ཡང་སེམས་ཅན་ཐམས་ཅད་དང་ཐུན་མོང་དུ་བྱས་ཏེ།
en: Moreover, Venerable Śāradvatīputra, when bodhisattva great beings practice the perfection of wisdom, without the considerations of śrāvakas or pratyekabuddhas, but through the focusing of their attention with all-aspect omniscience in mind, they maintain ethical discipline and indeed dedicate the roots of their virtuous actions to unsurpassed, complete enlightenment, making common cause with all beings.

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྔོ་བ་འདི་ནི། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་གོ་ཆའོ། །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་ཅིང་།
en: This is the armor of the perfection of ethical discipline possessed by bodhisattva great beings who practice the perfection of wisdom. “

source: ཉན་ཐོས་དང་། རང་སངས་རྒྱས་དང་ལྡན་པའི་ཡིད་ལ་བྱ་བས་མ་ཡིན་གྱི། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་ཡིད་ལ་བྱ་བས། ཆོས་དེ་དག་ལ་དེ་ལྟར་བཟོད་པ་ལ་གནས་ཤིང་རྟེན་ཏེ། དགེ་བའི་རྩ་བ་དེ་ཡང་སེམས་ཅན་ཐམས་ཅད་དང་ཐུན་མོང་དུ་བྱས་ཤིང་།
en: Moreover, Venerable Śāradvatīputra, when bodhisattva great beings practice the perfection of wisdom, without the considerations of śrāvakas or pratyekabuddhas, but through the focusing of their attention with all-aspect omniscience in mind, they maintain and are reliant on endurance with respect to all phenomena, and they indeed dedicate the roots of their virtuous actions to unsurpassed, complete enlightenment, making common cause with all beings.

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྔོ་བ་འདི་ནི། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པའི་གོ་ཆའོ། །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ།
en: This is the armor of the perfection of tolerance possessed by bodhisattva great beings who practice the perfection of wisdom. “

source: ཉན་ཐོས་དང་། རང་སངས་རྒྱས་དང་ལྡན་པའི་ཡིད་ལ་བྱ་བས་མ་ཡིན་གྱི། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་ཡིད་ལ་བྱ་བས། བརྩོན་འགྲུས་ཉམ་པར་མི་བྱེད་ཅིང་། དགེ་བའི་རྩ་བ་དེ་ཡང་སེམས་ཅན་ཐམས་ཅད་དང་ཐུན་མོང་དུ་བྱས་ཏེ།
en: Moreover, Venerable Śāradvatīputra, bodhisattva great beings are without the considerations of śrāvakas or pratyekabuddhas, but through the focusing of their attention with all-aspect omniscience in mind they do not degenerate in their perseverance and they indeed dedicate the roots of their virtuous actions to unsurpassed, complete enlightenment, making common cause with all beings.

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྔོ་བ་འདི་ནི། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་གོ་ཆའོ། །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་ཅིང་།
en: This is the armor of the perfection of perseverance possessed by bodhisattva great beings who practice the perfection of wisdom. “

source: ཉན་ཐོས་དང་། རང་སངས་རྒྱས་དང་ལྡན་པའི་ཡིད་ལ་བྱ་བས་མ་ཡིན་གྱི། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་ཡིད་ལ་བྱ་བས། སེམས་རྩེ་གཅིག་ཏུ་བྱེད་ཅིང་། དགེ་བའི་རྩ་བ་དེ་ཡང་སེམས་ཅན་ཐམས་ཅད་དང་ཐུན་མོང་དུ་བྱས་ཏེ།
en: Moreover, Venerable Śāradvatīputra, when bodhisattva great beings practice the perfection of wisdom without the considerations of śrāvakas or pratyekabuddhas, but through the focusing of their attention with all-aspect omniscience in mind, their minds are one-pointed, and, making common cause with all beings, they indeed dedicate the roots of their virtuous actions to unsurpassed, complete enlightenment.

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྔོ་བ་འདི་ནི། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་གོ་ཆའོ།
en: This is the armor of the perfection of meditative concentration possessed by bodhisattva great beings who practice the perfection of wisdom. {
